In [264]:
import pandas as pd

In [265]:
#carregar arquivo para dataframe pandas
dados = pd.read_csv("teste.csv")
dados

    Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [266]:
#formato
dados.shape

(5, 4)

In [267]:
#resumo estatistico de colunas numericas
dados.describe

<bound method NDFrame.describe of     Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00>

In [268]:
#primeiros registros 
dados.head

<bound method NDFrame.head of     Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00>

In [269]:
#ultimos registros, com parametros 
dados.tail(2)

    Nome  Idade Cidade   Saldo
3  Lucas     28     SP  5000.1
4  Maria     35     MG  3900.0

In [270]:
#filtrar por nome da coluna 
dados[["Saldo"]]

     Saldo
0  3200.50
1  4100.00
2  2890.75
3  5000.10
4  3900.00

In [271]:
#filtrar linhas por indice
dados.loc[1:3]

    Nome  Idade Cidade    Saldo
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10

In [272]:
#linhas 1 e 3
dados.loc[[1,3]]

    Nome  Idade Cidade   Saldo
1    Ana     30     RJ  4100.0
3  Lucas     28     SP  5000.1

In [273]:
#filtro
dados.loc[dados['Nome'] == "João"]

   Nome  Idade Cidade    Saldo
2  João     22     BH  2890.75

In [274]:
#outra condição 
dados.loc[dados["Saldo"] > 2800]

    Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [275]:
#atribuimos resultados a variavel, criando outro df
Saldo2 = dados.loc[dados["Idade"] > 15]
print(Saldo2)

    Nome  Idade Cidade    Saldo
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [276]:
#definimos so algumas colunas
Saldo3 = dados[['Cidade', 'Nome']].loc[dados['Saldo'] > 3200]
print(Saldo3)

  Cidade   Nome
0     SP    Vit
1     RJ    Ana
3     SP  Lucas
4     MG  Maria

In [277]:
#series, unica coluna 
#pode ser criada a partir da listas, arrau do numpy ou coluna do dataframe
s1 = pd.Series([2,5,3,34,54,23,1,16])
print(s1)

0     2
1     5
2     3
3    34
4    54
5    23
6     1
7    16
dtype: int64

In [278]:
#serie a partir de um array do numpy 
import numpy as np
array1 = np.array([2,5,3,34,54,23,1,16])
s2 = pd.Series(array1)
print(s2)

0     2
1     5
2     3
3    34
4    54
5    23
6     1
7    16
dtype: int32

In [279]:
#serie a partir de um dataframe
s3 = dados["Cidade"]
print(s3)
type(s3)

0    SP
1    RJ
2    BH
3    SP
4    MG
Name: Cidade, dtype: object

pandas.core.series.Series

In [280]:
#note a diferença, temos um data frame
d4 = dados[["Cidade"]]
type(d4)

pandas.core.frame.DataFrame

In [281]:
#Renomear
dados.rename(columns={"Saldo": "Banco"})

    Nome  Idade Cidade    Banco
0    Vit     25     SP  3200.50
1    Ana     30     RJ  4100.00
2   João     22     BH  2890.75
3  Lucas     28     SP  5000.10
4  Maria     35     MG  3900.00

In [282]:
#para a alteração não persiste 
dados.head(1)

  Nome  Idade Cidade   Saldo
0  Vit     25     SP  3200.5